-- 创建一个新的数据库，用于学习DQL
CREATE DATABASE IF NOT EXISTS test02 DEFAULT CHARSET utf8mb4;

-- 使用test02数据库
USE test02;

-- 1、创建一个新表emp，便于插入数据使用
CREATE TABLE IF NOT EXISTS emp
(
    id          INT UNSIGNED COMMENT '编号',
    worknum     VARCHAR(10) COMMENT '员工工号',
    name        VARCHAR(10) COMMENT '姓名',
    gender      CHAR(1) COMMENT '性别',
    age         TINYINT UNSIGNED COMMENT '年龄',
    idcard      VARCHAR(18) COMMENT '身份证号码',
    workaddress VARCHAR(50) COMMENT '工作地址',
    entrydate   DATETIME COMMENT '入职时间'
) COMMENT "员工表";

TRUNCATE TABLE emp;

-- 2、插入对应数据，便于DQL查询使用
INSERT INTO emp(id, worknum, name, gender, age, idcard, workaddress, entrydate)
VALUES (1, '1', '柳岩', '女', 20, '441283200001016400', '北京', '2000-01-01'),
       (2, '2', '张无忌', '男', 18, '441283200001016401', '北京', '2005-09-01'),
       (3, '3', '韦一笑', '男', 38, '441283200001016402', '上海', '2005-08-01'),
       (4, '4', '赵敏', '女', 18, '441283200001016403', '北京', '2009-12-01'),
       (5, '5', '小昭', '女', 16, '441283200001016404', '上海', '2007-07-01'),
       (6, '6', '杨逍', '男', 28, '441283200001016405', '北京', '2006-01-01'),
       (7, '7', '范进', '男', 40, '441283200001016406', '北京', '2005-05-01'),
       (8, '8', '黛绮丝', '女', 38, '441283200001016407', '天津', '2015-05-01'),
       (9, '9', '范凉凉', '女', 45, '441283200001016408', '北京', '2010-04-01'),
       (10, '10', '陈友谅', '男', 53, '441283200001016409', '上海', '2011-01-01'),
       (11, '11', '张士诚', '男', 55, '441283200001016410', '江苏', '2015-05-01'),
       (12, '12', '常遇春', '男', 32, '441283200001016411', '北京', '2004-02-01'),
       (13, '13', '张三丰', '男', 88, '441283200001016412', '江苏', '2020-11-01'),
       (14, '14', '灭绝', '女', 65, '441283200001016413', '西安', '2019-05-01'),
       (15, '15', '胡青牛', '男', 70, '441283200001016414', '西安', '2018-04-01'),
       (16, '16', '张三', '男', 25, '44128320000101640X', '广东', '2003-01-01'),
       (17, '17', '李四', '男', 23, '44128320020101880X', '湖南', '2007-09-01'),
       (18, '18', '周芷若', '女', 18, null, '北京', '2012-06-01');

-- 基本查询
-- 3、查询指定字段 name, worknum, age
-- 书写格式为：SELECT 字段名1, 字段名2,... FROM 表名;(列出部分字段名)
SELECT name, worknum, age
FROM emp;

-- 4、查询所有字段
-- 书写格式为：SELECT 字段1, 字段2, ... FROM 表名;(列出所有字段名)
SELECT id,
       worknum,
       name,
       gender,
       age,
       idcard,
       workaddress,
       entrydate
FROM emp;
-- 或者
-- 书写格式为：SELECT * FROM 表名;
/*
    这里需要注意，在开发过程中不要写*
    (1)首先，写*的话我们不清楚有什么字段，这样阅读性不好
    (2)其次就是*会影响查询效率，相对于整体字段来说，会慢很多
 */
SELECT *
FROM emp;

-- 5、查询所有员工的工作地址
-- 书写格式为：SELECT 字段名 AS 别名 FROM 表名;(别名最好加一个''这样便于阅读)
SELECT workaddress AS '工作地址'
FROM emp;
-- 或者写成：SELECT 字段名 别名 FROM 表名;(AS可以省略不写)
SELECT workaddress '工作地址'
FROM emp;

-- 6、查询公司员工的工作地址(不要重复，需要加上DISTINCT关键字)
-- 书写格式为：SELECT DISTINCT 字段名 FROM 表名;
SELECT DISTINCT workaddress AS '工作地址'
FROM emp;
